app/controllers/store_controller.rb

SELECT * FROM `products` ORDER BY title
---
  def index
    @products = Product.find_products_for_sale

SELECT * FROM `products` WHERE (`products`.`id` = 13)
---
  def add_to_cart
    session[:counter] = 0
    product = Product.find(params[:id])

SELECT * FROM `products` WHERE (`products`.`id` = 13)
---
  def remove_from_cart
    begin
      product = Product.find(params[:id])

INSERT INTO `line_items` (`order_id`, `updated_at`, `total_price`, `product_id`, `quantity`, `created_at`) VALUES(1, '2009-11-13 15:45:34', 56.0, 13, 2, '2009-11-13 15:45:34')
INSERT INTO `orders` (`name`, `updated_at`, `pay_type`, `address`, `email`, `created_at`) VALUES('Kay', '2009-11-13 15:45:34', 'cc', 'London', 'kshitija@studentrm.com', '2009-11-13 15:45:34')
---
  def save_order
    @order = Order.new(params[:order])
    @order.add_line_items_from_cart(@cart)
    if @order.save