app/controllers/users_controller.rb

  def index
    @users = User.find(:all, :order => :name)
---
SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO `users` (`name`, `salt`, `updated_at`, `hashed_password`, `created_at`) VALUES('kay', '570249800.621155802507813', '2009-11-16 12:21:24', '437fa42b64a5f7a82450d870196eee5cd3075a81', '2009-11-16 12:21:24')